RyanHailey21/esp32_drone/Mission.cpp
#include "Mission.h"
#include <NimBLEDevice.h>
#include "State.h"
#include "Msp.h"
#include "Control.h"
#include "Ble.h"
#include "FlightLog.h"

// 0=settling, 2=cascade active. Updated each ALT_HOLD iteration.
static uint8_t altHoldGuardPhase = 2;
static bool altHoldCascadeLatched = false;

static uint16_t angleModeChannelValue() {
    return ANGLE_MODE_ENABLED ? 1800 : 1000;
}

static uint16_t hoverTestAngleModeChannelValue() {
    return HOVER_TEST_ANGLE_MODE ? 1800 : 1000;
}

static bool attitudeAbortActive() {
    if ((lastFcDiagMask & (1 << 1)) == 0) return false;
    if (millis() - lastFcAttitudeMs > ATTITUDE_ABORT_MAX_AGE_MS) return false;
    return fabsf(lastFcRollDeciDeg / 10.0f) >= ATTITUDE_ABORT_DEG
        || fabsf(lastFcPitchDeciDeg / 10.0f) >= ATTITUDE_ABORT_DEG;
}

static bool testModeOrTestArming() {
    if (state == HOVER_TEST || state == ALT_HOLD || state == LANDING) {
        return true;
    }
    return state == ARMING
        && (armTarget == ARM_HOVER_TEST || armTarget == ARM_ALT_HOLD);
}

static void finishMissionOrLand(float altitude, const char* reason) {
    Serial.println(reason);
    if (MISSION_TYPE == 0) {
        startLanding(altitude);
    } else {
        state = CUT;
    }
}

static bool missionCeilingExceeded(float altitude) {
    return isfinite(altitude) && altitude >= ALT_MAX_M;
}

static uint16_t takeoffGuardThrottle(uint32_t timeInAltHoldMs, bool tofReady) {
    uint32_t rampMs = timeInAltHoldMs > BARO_SETTLE_MS ? timeInAltHoldMs - BARO_SETTLE_MS : 0;
    int32_t rampUs = (int32_t)((rampMs * (uint32_t)TAKEOFF_RAMP_US_PER_S) / 1000U);
    int32_t maxOffsetUs = tofReady ? TAKEOFF_MAX_OFFSET_US : TAKEOFF_INVALID_TOF_MAX_OFFSET_US;
    int32_t offsetUs = min(maxOffsetUs, (int32_t)TAKEOFF_NUDGE_US + rampUs);
    return (uint16_t)constrain((int32_t)HOVER_THROTTLE + offsetUs,
                               (int32_t)MIN_ALT_HOLD_THROTTLE_US,
                               (int32_t)HOVER_THROTTLE + maxOffsetUs);
}

static void printFlightLogHeader(const char* label, float targetM) {
    flightLogReset();
    flightLogAppendf("[RUN] %s type=%u hover=%u sprintThr=%u sprintYaw=%u cutoff=%.2f target=%.2f punchStart=%lu punchThr=%u kp=%.2f ki=%.2f kd=%.2f tofFull=%.2f tofZero=%.2f\n",
        label, MISSION_TYPE, HOVER_THROTTLE, SPRINT_THROTTLE, SPRINT_YAW,
        (float)SPRINT_CUTOFF_M, targetM, (unsigned long)PUNCH_START_MS, PUNCH_THROTTLE,
        (float)HOLD_KP, (float)HOLD_KI,
        (float)HOLD_KD, (float)TOF_BLEND_FULL_M, (float)TOF_BLEND_ZERO_M);
    flightLogAppend("[FLT] ms,state,phase,alt,lowRel,tof,tofW,baro,cbaro,src,setpt,fV,usedV,bfV,derV,vsrc,desV,aErr,vErr,P,I,rawThr,thr,minThr,maxThr,sat,accX,accY,accZ,gyroX,gyroY,gyroZ,roll,pitch,yaw,cycle,sensors,rcThr,cmdYaw,rcArm,rcAngle,vbat,amps,diag,tofRaw,tofReadOk,tofReject,tofDt,tofStatus,tofI2c\n");
#if SERIAL_FLIGHT_DEBUG
    Serial.printf("[RUN] %s type=%u hover=%u sprintThr=%u sprintYaw=%u cutoff=%.2f target=%.2f punchStart=%lu punchThr=%u kp=%.2f ki=%.2f kd=%.2f tofFull=%.2f tofZero=%.2f\n",
        label, MISSION_TYPE, HOVER_THROTTLE, SPRINT_THROTTLE, SPRINT_YAW,
        (float)SPRINT_CUTOFF_M, targetM, (unsigned long)PUNCH_START_MS, PUNCH_THROTTLE,
        (float)HOLD_KP, (float)HOLD_KI,
        (float)HOLD_KD, (float)TOF_BLEND_FULL_M, (float)TOF_BLEND_ZERO_M);
    Serial.println("[FLT] ms,state,phase,alt,lowRel,tof,tofW,baro,cbaro,src,setpt,fV,usedV,bfV,derV,vsrc,desV,aErr,vErr,P,I,rawThr,thr,minThr,maxThr,sat,accX,accY,accZ,gyroX,gyroY,gyroZ,roll,pitch,yaw,cycle,sensors,rcThr,cmdYaw,rcArm,rcAngle,vbat,amps,diag,tofRaw,tofReadOk,tofReject,tofDt,tofStatus,tofI2c");
#endif
}

static void markOpenLoopControl(uint16_t throttle) {
    lastAltError = 0.0f;
    lastDesiredVspeed = 0.0f;
    lastVspeedError = 0.0f;
    lastControlPUs = 0.0f;
    lastControlIUs = 0.0f;
    lastRawThrottle = throttle;
    lastThrMin = throttle;
    lastThrMax = throttle;
    lastClampedThrottle = throttle;
    lastThrottleSat = 0;
}

static void logFlightSample(uint32_t elapsedMs, const char* phase, float altitude,
                            float compatAlt, uint16_t throttle) {
    static uint32_t lastLogMs = 0;
    if (elapsedMs < lastLogMs || elapsedMs - lastLogMs >= 50) {
        lastLogMs = elapsedMs;
        flightLogAppendf("[FLT] %lu,%d,%s,%.3f,%.3f,%.3f,%u,%.3f,%.3f,%u,%.3f,%.3f,%d,%d,%d,%u,%.3f,%.3f,%.3f,%.0f,%.0f,%.0f,%u,%.0f,%.0f,%d,%d,%d,%d,%d,%d,%d,%.1f,%.1f,%d,%u,%u,%u,%u,%u,%u,%.1f,%.2f,%u,%.3f,%u,%u,%u,%u,%u\n",
            (unsigned long)elapsedMs,
            (int)state,
            phase,
            altitude,
            compatAlt,
            lastTofValid ? lastTofAltM : -1.0f,
            lastTofWeightPct,
            lastBaroAltM,
            lastCorrectedBaroAltM,
            lastAltitudeSource,
            internalSetpoint,
            filteredVario,
            lastVario,
            lastFcVario,
            lastDerivedVario,
            lastVarioSource,
            lastDesiredVspeed,
            lastAltError,
            lastVspeedError,
            lastControlPUs,
            lastControlIUs,
            lastRawThrottle,
            throttle,
            lastThrMin,
            lastThrMax,
            (int)lastThrottleSat,
            lastFcAccX,
            lastFcAccY,
            lastFcAccZ,
            lastFcGyroX,
            lastFcGyroY,
            lastFcGyroZ,
            lastFcRollDeciDeg / 10.0f,
            lastFcPitchDeciDeg / 10.0f,
            lastFcYawDeg,
            lastFcCycleTimeUs,
            lastFcSensorsMask,
            lastFcRcThrottle,
            channels[CH_YAW],
            lastFcRcArm,
            lastFcRcAngle,
            lastFcVbatDeciV / 10.0f,
            lastFcAmperageCentiA / 100.0f,
            lastFcDiagMask,
            lastTofRawM,
            lastTofReadOk ? 1 : 0,
            lastTofRejectReason,
            lastTofReadDtMs,
            lastTofRangeStatus,
            lastTofI2cStatus);
    }
}

static void pushTelemetry(float rawAlt, float altitude) {
    if (!telemetryChar) return;

    bool activeFlight = state == ARMING
                     || state == SPRINTING
                     || state == HOLDING
                     || state == PUNCHING
                     || state == HOVER_TEST
                     || state == LANDING
                     || state == ALT_HOLD;

    static uint32_t lastTelemetryMs = 0;
    uint32_t nowMs = millis();
    uint32_t periodMs = activeFlight
                      ? BLE_TELEMETRY_ACTIVE_PERIOD_MS
                      : BLE_TELEMETRY_IDLE_PERIOD_MS;
    if (nowMs - lastTelemetryMs < periodMs) return;
    lastTelemetryMs = nowMs;

    int32_t altCm     = (int32_t)(rawAlt * 100.0f);
    int32_t relCm     = (int32_t)(altitude * 100.0f);
    int16_t filtVarCs = (int16_t)constrain(filteredVario    * 100.0f, -32768.0f, 32767.0f);
    int16_t setptCm   = (int16_t)constrain(internalSetpoint * 100.0f, -32768.0f, 32767.0f);
    int16_t tofCm     = lastTofValid ? (int16_t)constrain(lastTofAltM * 100.0f, -32768.0f, 32767.0f) : -1;
    int32_t baroCm    = (int32_t)(lastBaroAltM * 100.0f);
    uint8_t tofValid  = lastTofValid ? 1 : 0;

    if (activeFlight) {
        uint16_t diagMask = lastFcDiagMask;
        uint8_t sensorFlags = 0;
        if (mspAltitudeFresh()) sensorFlags |= 0x01;
        if (lastTofValid) sensorFlags |= 0x02;
        if (millis() - lastFcAttitudeMs <= ATTITUDE_ABORT_MAX_AGE_MS) sensorFlags |= 0x04;

        uint8_t pkt[28];
        memcpy(pkt,      &altCm,                 4);
        memcpy(pkt + 4,  &relCm,                 4);
        pkt[8] = (uint8_t)state;
        memcpy(pkt + 9,  &channels[CH_THROTTLE], 2);
        memcpy(pkt + 11, &lastVario,             2);
        memcpy(pkt + 13, &filtVarCs,             2);
        memcpy(pkt + 15, &setptCm,               2);
        pkt[17] = altHoldGuardPhase;
        memcpy(pkt + 18, &lastFcVario,           2);
        memcpy(pkt + 20, &lastDerivedVario,      2);
        memcpy(pkt + 22, &diagMask,              2);
        pkt[24] = sensorFlags;
        pkt[25] = lastTofWeightPct;
        pkt[26] = lastAltitudeSource;
        pkt[27] = lastVarioSource;
        telemetryChar->setValue(pkt, sizeof(pkt));
        telemetryChar->notify();
        return;
    }

    int32_t cbaroCm   = (int32_t)(lastCorrectedBaroAltM * 100.0f);

    uint8_t pkt[77];
    memcpy(pkt,      &altCm,                 4);
    memcpy(pkt + 4,  &relCm,                 4);
    pkt[8] = (uint8_t)state;
    memcpy(pkt + 9,  &channels[CH_THROTTLE], 2);
    memcpy(pkt + 11, &lastVario,             2);
    memcpy(pkt + 13, &filtVarCs,             2);
    memcpy(pkt + 15, &setptCm,              2);
    pkt[17] = altHoldGuardPhase;
    memcpy(pkt + 18, &lastFcVario,           2);
    memcpy(pkt + 20, &lastDerivedVario,      2);
    memcpy(pkt + 22, lastMspAltitudePayload, 6);
    memcpy(pkt + 28, &channels[CH_ANGLE],    2);
    memcpy(pkt + 30, &tofCm,                 2);
    pkt[32] = lastTofWeightPct;
    pkt[33] = tofValid;
    memcpy(pkt + 34, &baroCm,                4);
    pkt[38] = lastAltitudeSource;
    memcpy(pkt + 39, &cbaroCm,               4);
    memcpy(pkt + 43, &lastFcDiagMask,        2);
    memcpy(pkt + 45, &lastFcAccX,            2);
    memcpy(pkt + 47, &lastFcAccY,            2);
    memcpy(pkt + 49, &lastFcAccZ,            2);
    memcpy(pkt + 51, &lastFcGyroX,           2);
    memcpy(pkt + 53, &lastFcGyroY,           2);
    memcpy(pkt + 55, &lastFcGyroZ,           2);
    memcpy(pkt + 57, &lastFcRollDeciDeg,     2);
    memcpy(pkt + 59, &lastFcPitchDeciDeg,    2);
    memcpy(pkt + 61, &lastFcYawDeg,          2);
    memcpy(pkt + 63, &lastFcCycleTimeUs,     2);
    memcpy(pkt + 65, &lastFcSensorsMask,     2);
    memcpy(pkt + 67, &lastFcRcThrottle,      2);
    memcpy(pkt + 69, &lastFcRcArm,           2);
    memcpy(pkt + 71, &lastFcRcAngle,         2);
    pkt[73] = lastFcVbatDeciV;
    memcpy(pkt + 74, &lastFcAmperageCentiA,  2);
    pkt[76] = lastVarioSource;
    telemetryChar->setValue(pkt, 77);
    telemetryChar->notify();
}

static void processPendingBleCommand() {
    uint8_t cmd = __atomic_exchange_n(&pendingBleCommand, 0, __ATOMIC_ACQ_REL);
    if (cmd == 0) return;

    switch (cmd) {
        case CMD_HOVER_TEST:
            if (state == IDLE || state == DONE) startHoverTest();
            else Serial.println("[BLE] Ignored hover test command: not idle");
            break;
        case CMD_START_MISSION:
            if (state == IDLE || state == DONE) startMission();
            else Serial.println("[BLE] Ignored mission command: not idle");
            break;
        case CMD_DISARM:
            if (state == HOVER_TEST || state == ALT_HOLD) bleRequestedLand = true;
            else disarmToIdle("[BLE] Disarm command");
            break;
        case CMD_KILL:
            disarmToIdle("[BLE] Kill command");
            break;
        case CMD_ALT_HOLD:
            if (state == IDLE || state == DONE) startAltHold();
            else Serial.println("[BLE] Ignored alt hold command: not idle");
            break;
        default:
            Serial.println("[BLE] Unknown command");
            break;
    }
}

void runMissionLoop() {
    uint32_t loopStartUs = micros();
    float    rawAlt      = getAltitude();
    float    altitude    = rawAlt - launchAlt;
    currentRelAlt        = altitude;
    uint32_t missionTime = millis() - launchTime;

