RyanHailey21/esp32_drone/Mission.cpp
    // Yaw is opt-in only during the autorotor sprint. Reset it every loop so
    // every transition, abort, test mode, and landing immediately returns to neutral.
    channels[CH_YAW] = RC_NEUTRAL_US;

    // Keep vario filter current every loop so LANDING and other states see fresh data.
    // Use a time-based filter so smoothing does not change with loop-rate jitter.
    bool varioFresh = (millis() - lastVarioMs) < VARIO_STALE_MS
                      && abs(lastVario) <= VARIO_CONTROL_MAX_CMS;
    if (varioFresh) {
        static uint32_t varioFilterLastMs = 0;
        uint32_t nowMs = millis();
        if (varioFilterLastMs == 0) varioFilterLastMs = nowMs;
        float dt = constrain((nowMs - varioFilterLastMs) / 1000.0f, 0.001f, 0.2f);
        varioFilterLastMs = nowMs;
        float rawMs = lastVario / 100.0f;
        float alpha = dt / (VARIO_TAU_S + dt);
        filteredVario += alpha * (rawMs - filteredVario);
    } else if (state == ALT_HOLD || state == HOLDING) {
        static uint32_t lastVarioWarnMs = 0;
        if (millis() - lastVarioWarnMs >= 500) {
            lastVarioWarnMs = millis();
#if SERIAL_FLIGHT_DEBUG
        Serial.printf("[VARIO] stale! lastVarioMs=%u raw=%d filtV=%.2f\n",
            lastVarioMs, lastVario, filteredVario);
#endif
        }
    }

    // BLE callback requests are consumed in the main loop to avoid racing MSP/RC writes.
    if (bleRequestedLand) {
        bleRequestedLand = false;
        bleSafetyLand = false;
        if (testModeOrTestArming()) {
            Serial.println("[BLE] Land request -> LANDING");
            startLanding(altitude);
        } else {
            Serial.println("[BLE] Land request ignored outside test mode");
        }
    }

    // BLE disconnect safety: land if triggered while in a test state
    if (bleSafetyLand) {
        bleSafetyLand = false;
        if (testModeOrTestArming()) {
            Serial.println("[BLE] Disconnect safety -> LANDING");
            startLanding(altitude);
        } else {
            Serial.println("[BLE] Disconnect ignored outside test mode");
        }
    }

    processPendingBleCommand();

    if ((state == SPRINTING || state == HOLDING || state == PUNCHING) && missionCeilingExceeded(altitude)) {
        finishMissionOrLand(altitude, "[MISSION] altitude ceiling exceeded");
    }

    switch (state) {

        // ── IDLE ─────────────────────────────────────────────
        case IDLE:
            channels[CH_ANGLE] = angleModeChannelValue();
            sendRC();
            digitalWrite(STATUS_LED, millis() % 1000 < 100);
            break;

        // ── ARMING ───────────────────────────────────────────
        case ARMING: {
            channels[CH_ARM]      = 1800;
            channels[CH_ANGLE]    = angleModeChannelValue();
            channels[CH_THROTTLE] = 1000;
            sendRC();
            digitalWrite(STATUS_LED, millis() % 200 < 100);

            if (millis() - armTime > ARM_CONFIRM_TIMEOUT_MS
                && !BENCH_MODE_ENABLED
                && (!lastFcArmed || millis() - lastFcStatusMs > FC_STATUS_FRESH_MS)) {
                disarmToIdle("[ARM] Betaflight did not confirm armed before timeout");
                break;
            }

            bool fcArmConfirmed = BENCH_MODE_ENABLED
                               || (lastFcArmed && millis() - lastFcStatusMs <= FC_STATUS_FRESH_MS);
            if (millis() - armTime > ARMING_MS && fcArmConfirmed) {
                switch (armTarget) {
                    case ARM_HOVER_TEST:
                        state = HOVER_TEST;
                        Serial.println("[STATE] → HOVER TEST");
                        break;

                    case ARM_ALT_HOLD:
                        resetAltitudeFusion();
                        launchAlt = getAltitude();
                        altHoldCascadeLatched = false;
                        resetCascadeController(0.0f);
                        state = ALT_HOLD;
                        printFlightLogHeader("ALT_HOLD",
                            constrain((float)ALT_HOLD_TARGET_M, ALT_HOLD_TARGET_MIN_M, ALT_HOLD_TARGET_MAX_M));
                        Serial.printf("[STATE] → ALT HOLD (launchAlt=%.2fm, target=%.1fm)\n",
                            launchAlt, constrain((float)ALT_HOLD_TARGET_M, ALT_HOLD_TARGET_MIN_M, ALT_HOLD_TARGET_MAX_M));
                        break;

                    default:  // ARM_MISSION
                        resetAltitudeFusion();
                        launchAlt  = getAltitude();
                        launchTime = millis();
                        printFlightLogHeader("MISSION", (float)TARGET_ALT_M);
                        state      = SPRINTING;
                        Serial.printf("[STATE] → SPRINTING (launchAlt=%.2fm)\n", launchAlt);
                        break;
                }
            }
            break;

        // ── SPRINTING ────────────────────────────────────────
        }
        case SPRINTING:
            channels[CH_ANGLE]    = angleModeChannelValue();
            channels[CH_THROTTLE] = SPRINT_THROTTLE;
            if (MISSION_TYPE == 1) {
                channels[CH_YAW] = constrain((uint16_t)SPRINT_YAW,
                                             (uint16_t)SPRINT_YAW_MIN_US,
                                             (uint16_t)SPRINT_YAW_MAX_US);
            }
            markOpenLoopControl(channels[CH_THROTTLE]);
            sendRC();
            logFlightSample(missionTime, "sprint", altitude, altitude, channels[CH_THROTTLE]);
            digitalWrite(STATUS_LED, millis() % 100 < 50);

#if SERIAL_FLIGHT_DEBUG
            Serial.printf("[SPRINT] t=%dms  alt=%.2fm  throttle=%d\n",
                missionTime, altitude, channels[CH_THROTTLE]);
#endif

            if (missionCeilingExceeded(altitude)) {
                finishMissionOrLand(altitude, "[MISSION] altitude ceiling exceeded");
                break;
            }

            if (missionTime >= 8000) {
                finishMissionOrLand(altitude, "[MISSION] time limit reached before hold");
                break;
            }

            if (altitude >= SPRINT_CUTOFF_M) {
                resetCascadeController(altitude);
                state = HOLDING;
                Serial.printf("[STATE] → HOLDING at %.2fm (target %.2fm)\n",
                    altitude, (float)TARGET_ALT_M);
            }
            break;

        // ── HOLDING ──────────────────────────────────────────
        case HOLDING: {
            channels[CH_ANGLE]    = angleModeChannelValue();
            uint16_t thr          = holdCascaded(altitude, true);
            channels[CH_THROTTLE] = thr;
            sendRC();
            logFlightSample(missionTime, "hold", altitude, altitude, thr);
            digitalWrite(STATUS_LED, HIGH);

#if SERIAL_FLIGHT_DEBUG
            Serial.printf("[HOLD] t=%dms  alt=%.2fm  setpt=%.2fm  thr=%d\n",
                missionTime, altitude, internalSetpoint, thr);
#endif

